// ประกาศฟังก์ชั่นหลักของโปรแกรม
// main เป็นจุดเริ่มต้นของโปรแกรม Rust ทุกโปรแกรมต้องมีฟังก์ชั่น main เพื่อให้สามารถรันได้
// () หลังจาก main หมายถึงว่าไม่มีพารามิเตอร์ที่ต้องส่งเข้าไปในฟังก์ชั่นนี้
// function block คือส่วนของโค้ดที่อยู่ภายในเครื่องหมายปีกกา {} ซึ่งเป็นส่วนที่กำหนดการทำงานของฟังก์ชั่น
// fn main() {
//     // ! เป็น macro ใน Rust ที่ใช้สำหรับพิมพ์ข้อความออกทางหน้าจอ
//     // ; เป็นตัวแยกระหว่าง expression และ statement ใน Rust
//     println!("Hello, world!");
// }

// ข้อดีของ Rust:
// High Forformance: Rust มีประสิทธิภาพสูงเนื่องจากการจัดการหน่วยความจำที่มีประสิทธิภาพ
// No Garbage Collector: Rust ไม่มีระบบเก็บขยะ (Garbage Collector) ซึ่งช่วยลดการใช้หน่วยความจำและเพิ่มประสิทธิภาพ
// parallelism: Rust มีระบบการจัดการการทำงานพร้อมกันที่มีประสิทธิภาพ ซึ่งช่วยให้สามารถใช้ประโยชน์จากหลายคอร์ของ CPU ได้อย่างเต็มที่
// Memory Safety: Rust มีระบบการจัดการหน่วยความจำที่ปลอดภัย ซึ่งช่วยลดปัญหาเกี่ยวกับการจัดการหน่วยความจำ เช่น การใช้หน่วยความจำที่ไม่ได้รับอนุญาตหรือการรั่วไหลของหน่วยความจำ
// Safe Concurrency: Rust มีระบบการจัดการการทำงานพร้อมกันที่ปลอดภัย ซึ่งช่วยลดปัญหาเกี่ยวกับการทำงานพร้อมกัน เช่น การ
// Scalability: Rust สามารถใช้ในการพัฒนาแอปพลิเคชันที่มีความสามารถในการปรับขนาดได้ดี เช่น เว็บเซิร์ฟเวอร์และระบบเครือข่าย

// Benefits of Rust:
// No Null Pointers: Rust ไม่มี null pointers ซึ่งช่วยลดปัญหาเกี่ยวกับการเข้าถึงข้อมูลที่ไม่ได้รับอนุญาต
// No Double Free: Rust ไม่มีปัญหาเกี่ยวกับการปล่อยหน่วยความจำสองครั้ง ซึ่งช่วยลดปัญหาเกี่ยวกับการจัดการหน่วยความจำ
// No Data Races: Rust ไม่มีปัญหาเกี่ยวกับการเข้าถึงข้อมูลที่ไม่ได้รับอนุญาตในสภาพแวดล้อมที่มีการทำงานพร้อมกัน
// No Use After Free: Rust ไม่มีปัญหาเกี่ยวกับการใช้หน่วยความจำที่ถูกปล่อยแล้ว ซึ่งช่วยลดปัญหาเกี่ยวกับการจัดการหน่วยความจำ

// fn main() {
//     let mut x = 10;
//     print!("x: {x}");
//     x = 20;
//     print!("x: {x}");
// }

// Scalar Types: Integers
// Signed integers: i8, i16, i32, i64, i128
// isize: ขนาดของตัวแปรขึ้นอยู่กับสถาปัตยกรรมของระบบ (32 บิตหรือ 64 บิต)

// Unsigned integers: u8, u16, u32, u64, u128
// usize: ขนาดของตัวแปรขึ้นอยู่กับสถาปัตยกรรมของระบบ (32 บิตหรือ 64 บิต)

// Scalar Types: Float, Char, Bool
// f32, f64: ตัวเลขทศนิยมที่มีความแม่นยำต่างกัน
// char: ตัวอักษร Unicode ที่มีขนาด 4 ไบต์ 32 bits
// bool: ค่าความจริงที่มีค่าเป็น true หรือ false 8 bits

// Literal Syntax & Widths
// Legible Integer Literals: 1_000_000 (สามารถใช้ _ เพื่อเพิ่มความอ่านง่ายของตัวเลข)
// Type Suffixes: 42u8 (สามารถใช้ suffix เพื่อระบุชนิดของตัวแปร เช่น u8, i32, f64 เป็นต้น)
// Bit Widths: i8, i16, i32, i64, i128 (ชนิดของตัวแปรที่มีความกว้างของบิตต่างกัน) 8 bit => 1 byte, 16 bit => 2 byte, 32 bit => 4 byte, 64 bit => 8 byte, 128 bit => 16 byte

// fn main() {
//     let x: i32 = 10; // ประกาศตัวแปร x เป็นชนิด i32 และกำหนดค่าเริ่มต้นเป็น 10
//     let y: f64 = 3.14; // ประกาศตัวแปร y เป็นชนิด f64 และกำหนดค่าเริ่มต้นเป็น 3.14
//     let z: char = 'A'; // ประกาศตัวแปร z เป็นชนิด char และกำหนดค่าเริ่มต้นเป็น 'A'
//     let is_true: bool = true; // ประกาศตัวแปร is_true เป็นชนิด bool และกำหนดค่าเริ่มต้นเป็น true

//     println!("x: {x}, y: {y}, z: {z}, is_true: {is_true}"); // พิมพ์ค่าของตัวแปร x, y, z, และ is_true ออกทางหน้าจอ
// }

// fn interproduct(a: i16, b: i16, c: i16) -> i16 {
//     a * b * c + b * c + c * a + a * b + a + b + c
// }

// fn main() {
//     println!("interproduct: {}", interproduct(120, 300, 400)); // เรียกใช้ฟังก์ชั่น interproduct โดยส่งค่า 2, 3, และ 4 และพิมพ์ผลลัพธ์ออกทางหน้าจอ
// }

// fn takes_u32(x: u32) {
//     println!("takes_u32: {x}"); // พิมพ์ค่าของตัวแปร x ออกทางหน้าจอ
// }

// fn takes_i8(x: i8) {
//     println!("takes_i8: {x}"); // พิมพ์ค่าของตัวแปร x ออกทางหน้าจอ
// }

// fn main() {
//     let x = 10;
//     let y = 20;

//     takes_u32(x);
//     takes_i8(y);
// }

fn main() {}

// excercise : Fibonacci (1/3)
// The Fibonacci sequence begins with 0 and 1.
// For n > 1, the next number in the sequence is the sum of the previous two numbers.
// ( fn = fn-1 + fn-2 )

// F(0) = 0
// F(1) = 1
// F(2) = F(1) + F(0) = 1 + 0 = 1
// F(3) = F(2) + F(1) = 1 + 1 = 2
// F(4) = F(3) + F(2) = 2 + 1 = 3
// F(5) = F(4) + F(3) = 3 + 2 = 5

// write a function fib(n: u32) that calculates the nth Fibonacci number
fn fib(n: u32) -> u32 {
    if n < 2 {
        return todo!("Implement This");
    } else {
        return todo!("Implement This");
    }
}
