fn main() {
    println!("Hello, world!");
}

// ข้อดีของ Rust:
// High Forformance: Rust มีประสิทธิภาพสูงเนื่องจากการจัดการหน่วยความจำที่มีประสิทธิภาพ
// No Garbage Collector: Rust ไม่มีระบบเก็บขยะ (Garbage Collector) ซึ่งช่วยลดการใช้หน่วยความจำและเพิ่มประสิทธิภาพ
// parallelism: Rust มีระบบการจัดการการทำงานพร้อมกันที่มีประสิทธิภาพ ซึ่งช่วยให้สามารถใช้ประโยชน์จากหลายคอร์ของ CPU ได้อย่างเต็มที่
// Memory Safety: Rust มีระบบการจัดการหน่วยความจำที่ปลอดภัย ซึ่งช่วยลดปัญหาเกี่ยวกับการจัดการหน่วยความจำ เช่น การใช้หน่วยความจำที่ไม่ได้รับอนุญาตหรือการรั่วไหลของหน่วยความจำ
// Safe Concurrency: Rust มีระบบการจัดการการทำงานพร้อมกันที่ปลอดภัย ซึ่งช่วยลดปัญหาเกี่ยวกับการทำงานพร้อมกัน เช่น การ
// Scalability: Rust สามารถใช้ในการพัฒนาแอปพลิเคชันที่มีความสามารถในการปรับขนาดได้ดี เช่น เว็บเซิร์ฟเวอร์และระบบเครือข่าย

// Benefits of Rust:
// No Null Pointers: Rust ไม่มี null pointers ซึ่งช่วยลดปัญหาเกี่ยวกับการเข้าถึงข้อมูลที่ไม่ได้รับอนุญาต
// No Double Free: Rust ไม่มีปัญหาเกี่ยวกับการปล่อยหน่วยความจำสองครั้ง ซึ่งช่วยลดปัญหาเกี่ยวกับการจัดการหน่วยความจำ
// No Data Races: Rust ไม่มีปัญหาเกี่ยวกับการเข้าถึงข้อมูลที่ไม่ได้รับอนุญาตในสภาพแวดล้อมที่มีการทำงานพร้อมกัน
// No Use After Free: Rust ไม่มีปัญหาเกี่ยวกับการใช้หน่วยความจำที่ถูกปล่อยแล้ว ซึ่งช่วยลดปัญหาเกี่ยวกับการจัดการหน่วยความจำ
